<script>
	let current = 1;
	let items = [
		{
			id: 1,
			name: 'Какой порядок оформления заявки на подбор авто?',
			text: `Заявку на подбор можно оформить онлайн (на сайте, либо по звонку на горячую линию), либо при личном посещении офиса. При личном посещении офиса, обсуждаются критерии и выполнимость заказа с менеджером по подбору. В случае, если оформление происходит онлайн, обсуждение параметров с менеджером происходит по телефону. По итогу, после обсуждения всех параметров подбираемого авто, клиенту направляется ссылка для ознакомления с договором и внесения предоплаты, после чего клиент получает договор с подписями и печатями организации, назначается эксперт.`
		},
		{
			id: 2,
			name: 'Можно ли вызвать вас в другую область?',
			text: 'Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		},
		{
			id: 3,
			name: 'Можно ли вызвать вас в другую область?',
			text: 'Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		},
		{
			id: 4,
			name: 'Можно ли вызвать вас в другую область?',
			text: 'Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		}
	];
</script>

<div class="sm:h-screen mt-12 sm:relative  max-w-7xl sm:pt-20 mx-5 sm:flex flex-col sm:mx-auto">
	<div>
		<h1 class="text-3xl sm:text-4xl mb-12 font-semibold">Частые вопросы</h1>
	</div>
	<div  class="sm:mt-12">
		{#each items as i}
			<div class="w-full sm:flex">
				<div class="sm:w-1/2 sm:my-0 my-4">
					<h1 class="sm:mt-4 sm:font-normal sm:text-base font-medium text-lg">{i.name}</h1>
				</div>
				<div class="sm:mt-4 sm:w-1/2 sm:absolute right-0">
					{#if current === i.id}
						<p class="">
							{i.text}
						</p>
					{/if}
				</div>
			</div>
		{/each}
	</div>
</div>
