<script>
	import { onMount } from 'svelte';

	let current = 1;

	let items = [
		{
			id: 1,
			name: 'Можно ли оформить услуги онлайн или обязательно личная встреча?',
			text: '<p>Встречать лично не обязательно. Сформировать запрос можно на сайте, позвонить по номеру телефона указанным на сайте, либо отправив запрос по одному из доступных способов связи (Telegram, WhatsApp) после чего с клиентом связывается менеджер и более детально обсуждается заказ.</p>'
		},
		{
			id: 2,
			name: 'Какой срок подбора?',
			text: '<p>По статистике нашего сервиса поиск более 90% авто занимает до двух недель. Длительность поиска зависит от количества объявлений и распространенности модели на вторичном рынке. <br/>   Новые версии, которые только вышли 1-2 года назад или коллекционные машины, а также нишевые, мало распространенные будет найти намного тяжелее, оттого и займет такой подбор больше времени. Не всегда быстрота – это залог успеха, особенно в таком кропотливом деле.</p>'
		},
		{
			id: 3,
			name: 'Как я могу отследить работу автоподборщика?',
			text: '<p>Работник будет с Вами связываться и присылать фото-видеоотчеты по поводу выездов на разные объявления. В них будет подробно расписана характеристика каждого экземпляра. Понравившиеся вам варианты он будет записывать, а уже из сформировавшегося пула отберет наиболее пригодную.</p>'
		},
		{
			id: 4,
			name: 'Можете ли вы осмотреть авто без моего присутствия?',
			text: '<p>Да, такая практика присутствует. Автоэксперт может сделать это без вашего присутствия. Для этого Вы предоставляете нам контакты продавца. Мы договариваемся о встрече и выполняем полную проверку автомобиля. Далее наш эксперт высылает Вам полный и диагностический отчёт, фото отчет. Дает рекомендации и делает свою оценку.</p>'
		}
	];
</script>

<div class="sm:h-[80vh] mt-12 sm:relative  max-w-7xl sm:pt-20 mx-5 sm:flex flex-col sm:mx-auto">
	<div>
		<h1 class="text-3xl  sm:text-4xl mb-12 font-semibold">Частые вопросы</h1>
	</div>
	<div class="sm:flex">
		<div class="sm:w-1/2">
			{#each items as i}
				<div class="">
					<h1 class:active={current === i.id} on:click={()=>current = i.id} class="pb-4 font-medium hover:scale-102 duration-500 sm:text-slate-500 cursor-pointer text">{i.name}</h1>
					{#if current === i.id}
					<div class="mb-5 sm:hidden">
						<p class="">{@html i.text}</p>
					</div>
					{/if}
				</div>
			{/each}
		</div>
		<div class="sm:w-1/2 hidden sm:flex">
			{#each items as i}
			{#if current === i.id}
				<div class="">
					<p class="px-12">{@html i.text}</p>
				</div>
				{/if}
			{/each}
		</div>
	</div>
</div>

<style>
	.active {
		color: #364168;
	}
</style>