<script>
	import { onMount } from 'svelte';

	let current = 1;

	let items = [
		{
			id: 1,
			name: 'Какой порядок оформления заявки на подбор авто?',
			text: '<p> Заявку на подбор можно оформить онлайн (на сайте, либо по звонку на горячую линию), либо при личном посещении офиса. <br/><br/> При личном посещении офиса, обсуждаются критерии и выполнимость заказа<br/> с менеджером по подбору. В случае, если оформление происходит онлайн, обсуждение параметров с менеджером происходит по телефону.<br/><br/> По итогу, после обсуждения всех параметров подбираемого авто, клиенту направляется ссылка для ознакомления с договором и внесения предоплаты, после чего клиент получает договор с подписями и печатями организации, назначается эксперт.</p>'
		},
		{
			id: 2,
			name: 'Можно ли вызвать вас в другую область?',
			text: '3Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		},
		{
			id: 3,
			name: 'Можно ли вызвать вас в другую область?',
			text: '2Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		},
		{
			id: 4,
			name: 'Можно ли вызвать вас в другую область?',
			text: '1Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		}
	];
</script>

<div class="sm:h-screen mt-12 sm:relative  max-w-7xl sm:pt-20 mx-5 sm:flex flex-col sm:mx-auto">
	<div>
		<h1 class="text-3xl  sm:text-4xl mb-12 font-semibold">Частые вопросы</h1>
	</div>
	<div class="sm:flex">
		<div class="sm:w-1/2">
			{#each items as i}
				<div class="">
					<h1 class:active={current === i.id} on:click={()=>current = i.id} class="pb-4 font-medium hover:scale-102 duration-500 sm:text-slate-500 cursor-pointer text-lg">{i.name}</h1>
					{#if current === i.id}
					<div class="mb-5">
						<p class="">{@html i.text}</p>
					</div>
					{/if}
				</div>
			{/each}
		</div>
		<div class="sm:w-1/2 hidden sm:flex">
			{#each items as i}
			{#if current === i.id}
				<div class="">
					<p class="">{@html i.text}</p>
				</div>
				{/if}
			{/each}
		</div>
	</div>
</div>

<style>
	.active {
		color: #364168;
	}
</style>