<script>
	let reviews = [
		{
			id: 1,
			name: 'Михаил',
			text: 'Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		},
		{
			id: 1,
			name: 'Михаил',
			text: 'Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		},
		{
			id: 1,
			name: 'Михаил',
			text: 'Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		},
		{
			id: 1,
			name: 'Михаил',
			text: 'Хочу поблагодарить данную компанию за великолепнуюи профессиональную работу.Мастера своего дела, которые подбирают машину,очень счательно. Всем советую!'
		}
	];
</script>

<div class="sm:h-[70vh] sm:relative  max-w-7xl pt-20 mx-5 sm:flex sm:mx-auto">
	<div class="w-full">
		<div class="">
			<h1 class="text-3xl sm:text-4xl font-semibold">Отзывы</h1>
		</div>
		<div class="sm:grid sm:mt-16 sm:grid-cols-4 grid gap-5 sm:gap-16 ">
			{#each reviews as r}
				<div class="bg-[#F5F5F5] p-7 rounded-lg w-full">
					<h1>{r.name}</h1>
					<p class=" text-sm">{r.text}</p>
				</div>
			{/each}
		</div>
		<div class="w-full flex justify-end  items-center mt-10">
				<p>Все отзывы</p>
		</div>
	</div>
</div>
